app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    @all_ratings = Movie.list

    if session[:ratings].nil?
      session[:ratings] = Hash.new
    @all_ratings.each do |rating|